In [2]:
import numpy as np
from pandas import Series,DataFrame

import pandas as pd

In [4]:
data = Series(['one','two',np.nan,'four'])

In [6]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [11]:
dframe = DataFrame([[1,2,3],[5,6,np.nan],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [15]:
clean_dframe = dframe.dropna()

In [17]:
clean_dframe = dframe.dropna(how='all')

In [19]:
clean_dframe

     0    1    2
0  1.0  2.0  3.0
1  5.0  6.0  NaN
2  7.0  NaN  9.0

In [26]:
# dropping columns for NaN
clean_dframe = dframe.dropna(axis=1,how='all')

In [27]:
clean_dframe

     0    1    2
0  1.0  2.0  3.0
1  5.0  6.0  NaN
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [46]:
nan = np.nan

dframe2 = DataFrame([[1,2,3,4],[1,2,nan,7],[nan,nan,nan,1],[5,7,nan,nan]])

In [47]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  2.0  NaN  7.0
2  NaN  NaN  NaN  1.0
3  5.0  7.0  NaN  NaN

In [48]:
dframe2.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  2.0  NaN  7.0
3  5.0  7.0  NaN  NaN

In [49]:
dframe2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  2.0  NaN  7.0

In [53]:
dframe2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  2.0  1.0  7.0
2  1.0  1.0  1.0  1.0
3  5.0  7.0  1.0  1.0

In [56]:
dframe2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  2.0  2.0  7.0
2  0.0  1.0  2.0  1.0
3  5.0  7.0  2.0  3.0

In [58]:
dframe2.fillna({0:0,1:1,2:2,3:3},inplace=True)

In [59]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  2.0  2.0  7.0
2  0.0  1.0  2.0  1.0
3  5.0  7.0  2.0  3.0